---
kind: type
id: T:Autodesk.Revit.DB.SlabShapeVertexArrayIterator
source: html/2c29534f-cad0-ae9b-1c3f-686572e8bc8f.htm
---
# Autodesk.Revit.DB.SlabShapeVertexArrayIterator

An iterator to an array of vertices used for Slab Shape Editing.

## Syntax (C#)
```csharp
public abstract class SlabShapeVertexArrayIterator : APIObject,
	IEnumerator
```